src/Catalogs/СегментыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СегментыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СпособыФормированияСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФормированияСегментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодическиОбновлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормироватьВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СегментыНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда   
   
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Инициализировать сегмент номенклатуры
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  ГенерироватьСегмент	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры(НаименованиеСегмента, НаименованиеРодителя = "", ГенерироватьСегмент = Истина) Экспорт

	НаименованиеСегмента = СокрЛП(НаименованиеСегмента);
	Если НЕ ЗначениеЗаполнено(НаименованиеСегмента) Тогда 
		Возврат ПустаяСсылка();
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеСегментаТочноеПопадание"	, СокрЛ(НаименованиеСегмента));		
	Запрос.УстановитьПараметр("НаименованиеСегмента"				, СокрЛ(НаименованиеСегмента) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК СегментНоменклатуры,
	|	ВложенныйЗапрос.Ссылка.Родитель КАК Родитель
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СегментыНоменклатуры.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|	ГДЕ
	|		СегментыНоменклатуры.Наименование ПОДОБНО &НаименованиеСегментаТочноеПопадание
	|		И СегментыНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		СегментыНоменклатуры.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|	ГДЕ
	|		СегментыНоменклатуры.Наименование ПОДОБНО &НаименованиеСегмента
	|		И СегментыНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Приоритет) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Приоритет";
	
	ВыборкаСегмент = Запрос.Выполнить().Выбрать();
	Если ВыборкаСегмент.Следующий() Тогда
		Если ЗначениеЗаполнено(СокрЛП(НаименованиеРодителя)) Тогда 
			ГруппаСегментов = ИнициализироватьГруппуСегментов(НаименованиеРодителя);
			Если ГруппаСегментов <> ВыборкаСегмент.Родитель Тогда 
				ПоместитьСегментВГруппу(ГруппаСегментов, ВыборкаСегмент.СегментНоменклатуры);
			КонецЕсли;	
		КонецЕсли;	
		Возврат ВыборкаСегмент.СегментНоменклатуры;
	ИначеЕсли ГенерироватьСегмент Тогда 
		Возврат СоздатьСегментНоменклатуры(НаименованиеСегмента, НаименованиеРодителя);
	Иначе 	
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

// Функция - Инициализировать группу сегментов
//
// Параметры:
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьГруппуСегментов(НаименованиеРодителя)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(НаименованиеРодителя)) Тогда 
		Возврат ПустаяСсылка();
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаименованиеГруппыСегментовТочноеПопадание"	, СокрЛ(НаименованиеРодителя));		
	Запрос.УстановитьПараметр("НаименованиеГруппыСегментов"					, СокрЛ(НаименованиеРодителя) + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Ссылка КАК ГруппаСегментов
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СегментыНоменклатуры.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|	ГДЕ
	|		СегментыНоменклатуры.Наименование ПОДОБНО &НаименованиеГруппыСегментовТочноеПопадание
	|		И СегментыНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|		И СегментыНоменклатуры.ЭтоГруппа = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		СегментыНоменклатуры.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
	|	ГДЕ
	|		СегментыНоменклатуры.Наименование ПОДОБНО &НаименованиеГруппыСегментов
	|		И СегментыНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|		И СегментыНоменклатуры.ЭтоГруппа = ИСТИНА
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Приоритет) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Приоритет";
	
	ВыборкаГруппыСегментов = Запрос.Выполнить().Выбрать();
	Если ВыборкаГруппыСегментов.Следующий() Тогда
		Возврат ВыборкаГруппыСегментов.ГруппаСегментов;
	Иначе
		Попытка
			Группа_Объект 				= СоздатьГруппу();
			Группа_Объект.Наименование 	= СокрЛ(НаименованиеРодителя);
			Если НЕ ЗначениеЗаполнено(Группа_Объект.Код) Тогда 
				Группа_Объект.УстановитьНовыйКод();
			КонецЕсли;
			// Сохраняем группу
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Группа_Объект);
			Возврат Группа_Объект.Ссылка;
		Исключение
			Возврат ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

// Процедура - Поместить сегмент в группу
//
// Параметры:
//  ГруппаСегментов		 - 	 - 
//  СегментНоменклатуры	 - 	 - 
//
Процедура ПоместитьСегментВГруппу(ГруппаСегментов, СегментНоменклатуры)
	
	Попытка	
		Сегмент_Объект = СегментНоменклатуры.ПолучитьОбъект();	
		Сегмент_Объект.Родитель = ГруппаСегментов;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Создать сегмент номенклатуры
//
// Параметры:
//  НаименованиеСегмента - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьСегментНоменклатуры(НаименованиеСегмента, НаименованиеРодителя = "")

	Если СокрЛП(НаименованиеСегмента) = "Услуги установки временной пломбы (A16.07.002.009)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУстановкиВременнойПломбы(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги установки постоянной пломбы (A16.07.002.001 - A16.07.002.012)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУстановкиПостояннойПломбы(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги гигиены (A16.07.051)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиГигиены(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги отбеливания (A16.07.050)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиОтбеливания(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги удаления зуба (A16.07.001, A16.07.024)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУдаленияЗуба(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги Синус-лифтинг (A16.07.055)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиСинусЛифтинг(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги имплантации (A16.07.054)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиИмплантации(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги установки брекет системы (А16.07.048)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУстановкиБрекетСистемы(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги установки элайнеров (А16.07.028, А16.07.048)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУстановкиЭлайнеров(НаименованиеСегмента, НаименованиеРодителя);
	ИначеЕсли СокрЛП(НаименованиеСегмента) = "Услуги удаления и имплантации (A16.07.054, A16.07.001, A16.07.024)" Тогда 
		Возврат ИнициализироватьСегментНоменклатуры_УслугиУдаленияИИмплантации(НаименованиеСегмента, НаименованиеРодителя);
	Иначе 
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

// Функция - Инициализировать сегмент номенклатуры услуги установки временной пломбы
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУстановкиВременнойПломбы(НаименованиеСегмента, НаименованиеРодителя = "")
              
	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.009";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги установки постоянной пломбы
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУстановкиПостояннойПломбы(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ГруппаЭлементовОтбор 				= ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбор.ТипГруппы 		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбор.Использование 	= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.001";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.002";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.003";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.004";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.005";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.006";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.007";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.008";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.010";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.011";    
	ЭлементОтбора.Использование 		= Истина;

	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.002.012";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги гигиены
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиГигиены(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.051";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги отбеливания
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиОтбеливания(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.050";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги удаления зуба
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУдаленияЗуба(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ГруппаЭлементовОтбор 				= ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбор.ТипГруппы 		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбор.Использование 	= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.001";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.024";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги синус лифтинг
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиСинусЛифтинг(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.055";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги имплантации
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиИмплантации(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.054";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги установки брекет системы
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУстановкиБрекетСистемы(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ЭлементОтбора 						= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.048";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги установки элайнеров
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУстановкиЭлайнеров(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ГруппаЭлементовОтбор 				= ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбор.ТипГруппы 		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбор.Использование 	= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.028";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.048";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

// Функция - Инициализировать сегмент номенклатуры услуги удаления и имплантации
//
// Параметры:
//  НаименованиеСегмента - 	 - 
//  НаименованиеРодителя - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСегментНоменклатуры_УслугиУдаленияИИмплантации(НаименованиеСегмента, НаименованиеРодителя = "")

	Сегмент_Объект 						= СоздатьЭлемент();
	Сегмент_Объект.ДатаСоздания 		= ТекущаяДатаСеанса();
	Сегмент_Объект.Наименование 		= СокрЛП(НаименованиеСегмента);
	Сегмент_Объект.Сотрудник 			= ПараметрыСеанса.ТекущийСотрудник;
	Сегмент_Объект.Родитель 			= ИнициализироватьГруппуСегментов(НаименованиеРодителя);	
	Сегмент_Объект.СпособФормирования 	= Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	
	// Настраиваем схему компановки
	СКД 								= ПолучитьМакет("ОсновнаяСхема");
	ЭлементыОтбора 						= СКД.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	ГруппаЭлементовОтбор 				= ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбор.ТипГруппы 		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбор.Использование 	= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.054";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.001";    
	ЭлементОтбора.Использование 		= Истина;
	
	ЭлементОтбора 						= ГруппаЭлементовОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ЭлементСписка.КодНоменклатурыМедицинскиУслуг");
	ЭлементОтбора.ВидСравнения 			= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение 		= "A16.07.024";    
	ЭлементОтбора.Использование 		= Истина;
	
	// Помещаем схему в хранилище
	Сегмент_Объект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СКД);	
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Сегмент_Объект.Код) Тогда 
			Сегмент_Объект.УстановитьНовыйКод();
		КонецЕсли;
		// Сохраняем сегмент
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сегмент_Объект);
		// Формируем сегмент
		Сегменты.Сформировать(Сегмент_Объект.Ссылка);
		Возврат Сегмент_Объект.Ссылка;
	Исключение
		МетаданныеСправочника 									= Метаданные.Справочники.СегментыНоменклатуры;		
		ШаблонКомментария = НСтр("ru = 'Не удалось инициализировать сегмент номенклатуры ""%1""
		|по причине: %2'");
		
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																			, НаименованиеСегмента
																			, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		МетаданныеСправочника,,
		Комментарий);
		
		Возврат ПустаяСсылка();
	КонецПопытки;
	
КонецФункции








#КонецОбласти

#КонецЕсли
